In [1]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [2]:
# 欠損値の扱いについて考える
# まずはSeriesから
string_data = pd.Series(['aardwark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardwark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
# 欠損値判定する
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [4]:
# 欠損値をdropする
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
# 欠損値でないものでマスクする
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
# DataFrameの欠損値の扱いについて
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
# dropnaで欠損値のあるレコードを削除
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
# 欠損値のあるレコードが削除されていることを確認
cleaned

     0    1    2
0  1.0  6.5  3.0

In [8]:
# 全てのカラムに対して欠損値をもつレコードのみ削除
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [10]:
# カラム方向に全てが欠損値であるものを削除
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
df = pd.DataFrame(np.random.randn(7, 3))

In [12]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.556308       NaN       NaN
1  0.539010       NaN       NaN
2 -0.113843       NaN -1.045252
3 -1.426426       NaN  0.218558
4 -1.486282  0.715259 -0.999943
5  1.789124 -1.256018  0.800725
6  0.653797 -0.101545  0.183753

In [13]:
# dropする際に閾値を設定する
# 例えばthresh=3とすると、欠損値でない値が3個以上含まれている行を残す
df.dropna(thresh=3)

          0         1         2
4 -1.486282  0.715259 -0.999943
5  1.789124 -1.256018  0.800725
6  0.653797 -0.101545  0.183753

In [14]:
# 欠損値を0で埋める
df.fillna(0)

          0         1         2
0  1.556308  0.000000  0.000000
1  0.539010  0.000000  0.000000
2 -0.113843  0.000000 -1.045252
3 -1.426426  0.000000  0.218558
4 -1.486282  0.715259 -0.999943
5  1.789124 -1.256018  0.800725
6  0.653797 -0.101545  0.183753

In [15]:
# 欠損値を埋めるとき、どのカラムに適応するかをディクショナリで指定できる
df.fillna({1: 0.5, 2: -1})

          0         1         2
0  1.556308  0.500000 -1.000000
1  0.539010  0.500000 -1.000000
2 -0.113843  0.500000 -1.045252
3 -1.426426  0.500000  0.218558
4 -1.486282  0.715259 -0.999943
5  1.789124 -1.256018  0.800725
6  0.653797 -0.101545  0.183753

In [16]:
# inplaceをTrueにすると破壊的変更がおこる
_ = df.fillna(0, inplace=True)

In [17]:
df

          0         1         2
0  1.556308  0.000000  0.000000
1  0.539010  0.000000  0.000000
2 -0.113843  0.000000 -1.045252
3 -1.426426  0.000000  0.218558
4 -1.486282  0.715259 -0.999943
5  1.789124 -1.256018  0.800725
6  0.653797 -0.101545  0.183753

In [18]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -2.153475 -0.513008  0.287283
1 -1.920441  0.728693 -1.504435
2 -1.104730       NaN  1.768535
3 -0.129134       NaN -0.588213
4 -0.085583       NaN       NaN
5 -0.376574       NaN       NaN

In [19]:
# ffillで埋める
df.fillna(method='ffill')

          0         1         2
0 -2.153475 -0.513008  0.287283
1 -1.920441  0.728693 -1.504435
2 -1.104730  0.728693  1.768535
3 -0.129134  0.728693 -0.588213
4 -0.085583  0.728693 -0.588213
5 -0.376574  0.728693 -0.588213

In [20]:
# ffillに回数制限を設定できる
df.fillna(method='ffill', limit=2)

          0         1         2
0 -2.153475 -0.513008  0.287283
1 -1.920441  0.728693 -1.504435
2 -1.104730  0.728693  1.768535
3 -0.129134  0.728693 -0.588213
4 -0.085583       NaN -0.588213
5 -0.376574       NaN -0.588213

In [21]:
# 平均値で欠損値埋めする
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64